artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_debug_20260330_124728/cases/lumped_solid/0/shell/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/shell";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    shell_to_ambient
    {
        type            calculated;
        value           uniform 0;
    }
    shell_to_jellyRoll
    {
        type            calculated;
        value           uniform 0;
    }
    shell_to_cap
    {
        type            calculated;
        value           uniform 0;
    }
}

// ************************************************************************* //
