artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_debug_20260330_124728/cases/lumped_solid/system/ambient/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/ambient";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
        preconditioner  DIC;
        agglomerator    assembledFaceAreaPair;
        maxIter         100;
        cacheAgglomeration false;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-7;
        relTol          0;
    }

    h
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        preconditioner  DIC;
        smoother        GaussSeidel;
        agglomerator    assembledFaceAreaPair;
        cacheAgglomeration false;
    }

    hFinal
    {
        $h;
        tolerance       1e-7;
        relTol          0;
    }

    "(U|k|epsilon|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

    "(U|k|epsilon|R)Final"
    {
        $U;
        tolerance       1e-7;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors                 1;
    nNonOrthogonalCorrectors    0;
    momentumPredictor           no;
    frozenFlow                  yes;
    pRefPoint                   (0 0 0);
    pRefValue                   1e5;
}

SIMPLE
{
    momentumPredictor   no;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    frozenFlow          yes;
    pRefPoint       (0 0 0);
    pRefValue       1e5;

    residualControl
    {
        default         1e-20;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.3;
    }
    equations
    {
        U               0.5;
        h               0.3;
    }
}

// ************************************************************************* //
