artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_debug_20260330_124728/cases/lumped_solid/system/volFieldValue
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      volFieldValue;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

volFieldValue
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");
    regionType      all;
    operation       volAverage;
    fields          (T);
    writeFields     false;
}

// ************************************************************************* //
